---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeConstraintRadius.ArcReferenceType
source: html/6c4a614b-f99f-3f69-fdb1-9f326c16f7a4.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintRadius.ArcReferenceType Property

The choice of rule for measuring the radius.

## Syntax (C#)
```csharp
public RebarShapeArcReferenceType ArcReferenceType { get; }
```